"""რა არის შემდეგი კოდის გამომავალი?

num1 = შეყვანა ("შეიყვანეთ შემთხვევითი ნომერი")
ბეჭდვა (num1 * 2)

კოპირება

მიმართეთ

ა) რიცხვი გამრავლებული 2-ზე ბ) რიცხვი ორჯერ გამეორებული გ) შეცდომა D) არცერთი ზემოთ ჩამოთვლილი

განმარტება: სწორი პასუხია B. input() ფუნქცია აბრუნებს სტრიქონს. როდესაც სტრიქონს ამრავლებთ მთელ რიცხვზე, ის ბევრჯერ იმეორებს სტრიქონს. ასე რომ, თუ მომხმარებელი შეიყვანს "6", გამომავალი იქნება "62".




#2 კითხვა
# 
# 
# 
# ქვემოთ ჩამოთვლილთაგან რომელია სწორი გზა პითონში სიის შესაქმნელად? ა) list = (1, 2, 3, 4) ბ) list = {1, 2, 3, 4} გ) list = [1, 2, 3, 4] დ) list = <1, 2, 3, 4>

განმარტება: სწორი პასუხია C. პითონში სიები იქმნება კვადრატული ფრჩხილების გამოყენებით [].


რას აკეთებს len() ფუნქცია პითონში? ა) აბრუნებს მიმდევრობის ბოლო ელემენტს ბ) აბრუნებს მიმდევრობის სიგრძეს გ) აბრუნებს მიმდევრობის პირველ ელემენტს D) აბრუნებს ყველა ელემენტის ჯამს მიმდევრობაში

განმარტება: სწორი პასუხია B. len() ფუნქცია აბრუნებს ნივთების რაოდენობას ობიექტში. როდესაც ობიექტი არის სტრიქონი, ის აბრუნებს სიმბოლოების რაოდენობას სტრიქონში.



ქვემოთ ჩამოთვლილთაგან რომელი გამოიყენება პითონში კომენტარის დასამატებლად? ა) // ბ) /* */ გ) # დ)

განმარტება: სწორი პასუხია C. პითონში, ერთხაზიანი კომენტარები ემატება # სიმბოლოს გამოყენებით. ამ ხაზის #-ის შემდეგ ყველაფერი განიხილება როგორც კომენტარი და იგნორირებულია პითონის თარჯიმნის მიერ."""