#  1) მომხმარებელს შემოატანინეთ ორი რიცხვი, შემდეგ შექმენით ფუნქცია ეს ორი რიცხვი გადაეცით ამ ფუნქციას პარამეტრები/არგუმენტებად, შემდეგ კი ამ ფუნქციამ უნდა დააბრუნოს ამ როი რიცხვის ჯამი
#     2) მომხმარებელს შემოატანინეთ ორი რიცხვი, შემდეგ შექმენით 4 სხვადსასხვა ფუნქცია ერთი მიმატების, ერთი გამოკლების, ერთი გამრავლების, ერთი გაყოფის, ყველა ფუნქციას უნდა ქონდეს პარამეტრი ამ რი რიცხვისთვის გამოიძახეთ ყველა ფუნქცია და გადაეცით მომხმარებლის შემოტანილი რიცხვები არგუმენტებად
#    3) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ შექმენით ფუნქცია რომელიც მიიღებს პარამტეტრად მომხმარებლის შემოტანილ რიცხვს, ფუნქციამ უნდა დააბრუნოს ეს რიცხვი დადებითია თუ უარყოფითია
#     4) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელიც მიიღებს პარამტეტრად მომხმარებლის შემოტანილ რიცხვს ფუნქციამ უნდა დააბრუნოს ეს რიცხვი ლუწია თუ კენტი
#     5) მომხმარებელს შემოატანინეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელიც მიიღებს პარამტეტრად მომხმარებლის შემოტანილ რიცხვს ფუნქციამ უნდა დააბრუნოს ეს რიცხვი არის თუ არა ხუთის ჯერადი 

# pop = int(input("num num num"))
# popa = int(input("num num num"))
# def popy (num1,num2):
#     print(num1 + num2)
# popy(pop ,popa)




# num = int(input("nummmmmmmmmmmm"))
# num1 = int(input("nummmmmmmmmmmmmmmmmmmmmmmmmmm"))
# def gakofa(numbera1,numera2)
#     print(numbera1 / numera2)
# gakofa(num, num1)

# def gamokleba(numbera1,numera2)
#     print(numbera1 - numera2)
# gamokleba(num,num1)




# num =input("num")
# def fun(num):
#     if num > 0:
#         print("positive")
#     else:
#         print("negative")
# fun(num)




# num =int(input("num"))
# def five (jumberiko):
#     if jumberiko % 5 == 0:
        




